from matplotlib import font_manager
from matplotlib import pyplot as plt

"""
直方图应用场景：
   1.用户的年龄分布状态
   2.一段时间内用户点击次数的分布状态
   3.用户活跃的分布状态
"""

# 一般用于没有进行统计过的数据才需要画直方图用不了hist方法

a = [63, 63, 66, 73, 73, 96, 129, 177, 260, 291, 316, 341, 365, 453, 484, 493, 576, 602, 575, 587, 576, 659, 618, 727,
     664, 56, 56, 60, 63, 67, 76, 93, 107, 123, 137, 141, 141, 38, 119, 37, 170, 175, 175, 161, 163, 155, 143, 171, 167,
     164, 301, 304, 315, 309, 345, 392, 458, 549, 681, 753, 827, 854, 875, 994, 1093, 1104, 1121, 1071, 1168, 1221,
     1205, 1327, 1458, 1302, 1382]

# 如何给定分类组数  组数 = 极差/组距
# 设置一个计算组数
d = 100  # 组距
num_bins = (max(a)-min(a))//d
print(max(a), min(a), max(a)-min(a))
print(num_bins)

# 设置图像 density计算各组比率
plt.hist(a, num_bins, density=True)

# 设置x轴的刻度
plt.xticks(range(min(a), max(a) + d, d))  # max(a)不加d无法取到最大值

plt.grid(alpha=0.4)

# 保存图片
plt.savefig('./直方图')

plt.show()
